API Automation/Week1.Day1/Calci_Collection.postman_collection.json

{
	"info": {
		"_postman_id": "155f40cd-c0f7-4048-bd77-027fffa54716",
		"name": "Calci_Collection",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "5092953"
	},
	"item": [
		{
			"name": "Calci_Addition",
			"protocolProfileBehavior": {
				"disabledSystemHeaders": {
					"content-type": true
				}
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Add xmlns=\"http://tempuri.org/\">\r\n      <intA>2</intA>\r\n      <intB>2</intB>\r\n    </Add>\r\n  </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					]
				}
			},
			"response": []
		}
	]
}